Конфигурация/InformationRegisters/ПредметыИУчастникиДействийКомплексныхПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ПредметыИУчастникиДействийКомплексныхПроцессов</Name>
			<Comment>Используется для хранения участников действий комплексных процессов для проверки прав. После запуска действия записи с его участниками удаляются.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплексныйПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.КомплексныйПроцесс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПредмета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИменаПредметов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныУтверждения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОзнакомления</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСоставныхБизнесПроцессов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРассмотрения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСогласования</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПоручения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПриглашения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПредметыИУчастникиДействийКомплексныхПроцессов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет записи по действия в регистре.
// Существующие записи замещаются.
//
// Параметры:
//  Действие - СправочникОбъект<ИмяШаблонаПроцесса>
//             СправочникСсылка<ИмяШаблонаПроцесса> - служебный шаблон комплексного процесса.
//
Процедура ДобавитьЗаписиПоДействию(Действие) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Действие)) Тогда
		РеквизитыДействия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Действие, "Ссылка, КомплексныйПроцесс, Предметы");
		РеквизитыДействия.Предметы = РеквизитыДействия.Предметы.Выгрузить();
	Иначе
		РеквизитыДействия = Действие;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыДействия.Ссылка)
		Или Не ЗначениеЗаполнено(РеквизитыДействия.КомплексныйПроцесс) Тогда
		
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ШаблонДействия.Установить(РеквизитыДействия.Ссылка);
	
	ТаблицаЗаписей = НаборЗаписей.ВыгрузитьКолонки();
	
	МенеджерДействия = ОбщегоНазначения.МенеджерОбъектаПоСсылке(РеквизитыДействия.Ссылка);
	УчастникиДействия = МенеджерДействия.УчастникиДляПроверкиПрав(Действие);
	
	Для Каждого СтрУчастник Из УчастникиДействия Цикл
		Для Каждого СтрПредмет Из РеквизитыДействия.Предметы Цикл
			Запись = ТаблицаЗаписей.Добавить();
			Запись.ИмяПредмета = СтрПредмет.ИмяПредмета;
			Запись.Участник = СтрУчастник.Участник;
			Запись.ШаблонДействия = РеквизитыДействия.Ссылка;
			Запись.Изменение = СтрУчастник.Изменение;
			Запись.КомплексныйПроцесс = РеквизитыДействия.КомплексныйПроцесс;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаЗаписей.Свернуть("ИмяПредмета, Участник, ШаблонДействия, КомплексныйПроцесс", "Изменение");
	
	НаборЗаписей.Загрузить(ТаблицаЗаписей);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет записи действия в регистре.
//
// Параметры:
//  Действие  - СправочникСсылка<ИмяШаблонаПроцесса> - служебный шаблон комплексного процесса.
//
Процедура УдалитьЗаписиДействия(Действие) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Действие) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ШаблонДействия.Установить(Действие.Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
